src/Catalogs/ЭкземплярыКомплектующихИзделийКорабля/ЭкземплярыКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭкземплярыКомплектующихИзделийКорабля</name>
  <owners>Catalog.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</owners>
  <attributes>
    <name>СудовойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетныйНомер</name>
    <comment>Учетный номер изделия по справочнику Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПозиции</name>
    <comment>Номер позиции на чертеже системы</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <comment>Помещение, в котором установлен экземпляр комплектующего изделия</comment>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовления</name>
    <comment>Дата изготовления комплектующего изделия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВвода</name>
    <comment>Дата ввода в эксплуатацию</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабль</name>
    <comment>для связи при отборах</comment>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля/ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля</name>
  <comment>История технического обслуживания и ремонта экземпляров комплектующих изделий корабля</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТрудоемкостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоемкостьСопутствующихРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительРабот</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НаработкаЭкземляровКомплектующихИзделийКорабля/НаработкаЭкземляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаработкаЭкземляровКомплектующихИзделийКорабля</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеСНачалаЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоЦикла</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ЭкземплярыКомплектующихИзделийКорабля/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Объект.Наименование = Строка(Объект.Владелец);
		
		ПроверитьПревышениеКоличества();
		
		// ++ 02.07.2018 15:03:46 Базунов Д.А. Задача: 
		// Перенес сюда, т.к. при создании нового не работает отбор по помещениям
		Объект.Корабль = Объект.Владелец.Владелец;
		// -- 02.07.2018 15:03:46 Базунов Д.А. Задача:
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПревышениеКоличества()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭкземплярыКомплектующихИзделийКорабля.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭкземплярыКомплектующихИзделийКорабля КАК ЭкземплярыКомплектующихИзделийКорабля
	|ГДЕ
	|	ЭкземплярыКомплектующихИзделийКорабля.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПревышеноКоличество = (Выборка.Количество() >= Объект.Владелец.Количество);
	
КонецФункции

&НаКлиенте
Процедура ДатаИзготовленияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаВвода) И Объект.ДатаИзготовления > Объект.ДатаВвода Тогда
		
		Сообщить("Введенная дата изготовления больше даты ввода в эксплуатацию");
		Объект.ДатаИзготовления = Дата("00010101");
		
	ИначеЕсли Объект.ДатаИзготовления > ТекущаяДата() Тогда
		
		Сообщить("Введенная дата изготовления больше текущей!");
		Объект.ДатаИзготовления = Дата("00010101");
		
	ИначеЕсли Не ВведеннаяДатаКорректна(Объект.ДатаИзготовления, Объект.Ссылка) Тогда
		
		Сообщить("Введенная дата изготовления меньше одной из дат ТОиР и/или наработки (см. соотв. таблицы)");
		Объект.ДатаИзготовления = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВводаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаИзготовления) И  Объект.ДатаВвода < Объект.ДатаИзготовления Тогда
		
		Сообщить("Введенная дата ввода в эксплуатацию меньше даты изготовления");
		Объект.ДатаВвода = Дата("00010101");
		
	ИначеЕсли Объект.ДатаВвода > ТекущаяДата() Тогда
		
		Сообщить("Дата изготовления больше текущей!");
		Объект.ДатаВвода = Дата("00010101");
		
	ИначеЕсли Не ВведеннаяДатаКорректна(Объект.ДатаВвода, Объект.Ссылка) Тогда
		
		Сообщить("Дата изготовления меньше одной из дат ТОиР и/или наработки (см. соотв. таблицы)");
		Объект.ДатаВвода = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры

//процедура проверяет наличие в регистрах истории ТОиР и Наработки записей под данному экземпляру,
//являющих более ранними, чем введенная дата
&НаСервереБезКонтекста
Функция ВведеннаяДатаКорректна(ВведеннаяДата, Экземпляр)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.Период КАК Период
	|ИЗ
	|	РегистрСведений.ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля КАК ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля
	|ГДЕ
	|	ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.Экземпляр = &Экземпляр
	|	И ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.Период < &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаработкаЭкземляровКомплектующихИзделийКорабля.Период
	|ИЗ
	|	РегистрСведений.НаработкаЭкземляровКомплектующихИзделийКорабля КАК НаработкаЭкземляровКомплектующихИзделийКорабля
	|ГДЕ
	|	НаработкаЭкземляровКомплектующихИзделийКорабля.Экземпляр = &Экземпляр
	|	И НаработкаЭкземляровКомплектующихИзделийКорабля.Период < &Дата";
	Запрос.УстановитьПараметр("Экземпляр", Экземпляр);
	Запрос.УстановитьПараметр("Дата", ВведеннаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПревышеноКоличество Тогда
		
		ПоказатьПредупреждение(, "С учетом добавляемого экземпляра количество экземпляров изделия превышает указанное в карточке!");
		
	КонецЕсли;
	
КонецПроцедуры
